In [1]:
%load_ext sql
%config SqlMagic.style = '_DEPRECATED_DEFAULT'
%sql mysql+pymysql://root:password@localhost:3306/lastcourse

In [ ]:
# %reload_ext sql
# %config SqlMagic.style = '_DEPRECATED_DEFAULT'
# %sql mysql+pymysql://root:password@localhost:3306/lastcourse

# Subquerry

In [3]:
%%sql
create table employees3(EmployeeID int not null,Name varchar(20) not null,Department varchar(20) not null,Salary decimal(10,2) not null);
insert into employees3 values(1,"Alice Johnson","HR",60000),(2,"Bob Smith","HR",70000),(3,"Charlie Brown","IT",80000),(4,"David Wilson","IT",90000),(5,"Eva Green","Sales",50000),(6,"Frank White","Sales",50000),(7,"Grace Black","IT",80000);

 * mysql+pymysql://root:***@localhost:3306/lastcourse
0 rows affected.
7 rows affected.

[]

Inner part excecutes first
types;
1. single row subquerry
2. multi rows subquerry
3. correlated subquerry
4.

In [4]:
%%sql
SELECT * FROM employees3;

 * mysql+pymysql://root:***@localhost:3306/lastcourse
7 rows affected.

[(1, 'Alice Johnson', 'HR', Decimal('60000.00')),
 (2, 'Bob Smith', 'HR', Decimal('70000.00')),
 (3, 'Charlie Brown', 'IT', Decimal('80000.00')),
 (4, 'David Wilson', 'IT', Decimal('90000.00')),
 (5, 'Eva Green', 'Sales', Decimal('50000.00')),
 (6, 'Frank White', 'Sales', Decimal('50000.00')),
 (7, 'Grace Black', 'IT', Decimal('80000.00'))]

1. Employee name whos getting salary greater than avg salary
2. Employee name whos getting salary as same as 'grace black'
3. Employee name whos getting salary greater than emp id 2

In [7]:
%%sql
SELECT DISTINCT name AS Employee_name
FROM employees3
WHERE salary > (SELECT AVG(salary) FROM employees3);

 * mysql+pymysql://root:***@localhost:3306/lastcourse
4 rows affected.

[('Bob Smith',), ('Charlie Brown',), ('David Wilson',), ('Grace Black',)]

In [10]:
%%sql
SELECT name AS employee_name
FROM employees3
WHERE salary = (SELECT salary FROM employees3 WHERE name LIKE "grace black");

 * mysql+pymysql://root:***@localhost:3306/lastcourse
2 rows affected.

[('Charlie Brown',), ('Grace Black',)]

In [13]:
%%sql
SELECT name AS emp_name
FROM employees3
WHERE salary > (SELECT salary FROM employees3 WHERE employeeid = 2);

 * mysql+pymysql://root:***@localhost:3306/lastcourse
3 rows affected.

[('Charlie Brown',), ('David Wilson',), ('Grace Black',)]

1. Emp name whos salary greater than the max salary of hr dept
2. No of emp whos getting less than tha min salary of it dept
3. Emp name whos getting salary greater than the salary of charlie brown and also greater than the salary of 'alice johnson'
4. Emp name whos getting salary less than salary of emp id 1 and greater than the salary of emp id 7

In [14]:
%%sql
SELECT name AS emp_name
FROM employees3
WHERE salary > (SELECT MAX(salary) FROM employees3 WHERE department LIKE "HR");

 * mysql+pymysql://root:***@localhost:3306/lastcourse
3 rows affected.

[('Charlie Brown',), ('David Wilson',), ('Grace Black',)]

In [15]:
%%sql
SELECT count(*) AS no_of_emp
FROM employees3
WHERE salary < (SELECT MIN(salary) FROM employees3 WHERE department LIKE "IT");

 * mysql+pymysql://root:***@localhost:3306/lastcourse
1 rows affected.

[(4,)]

In [23]:
%%sql
SELECT name AS employee
FROM employees3
WHERE salary > (SELECT MAX(salary) 
                FROM employees3 
                WHERE name IN ("Alice Johnson", "Charlie Brown")
                );

 * mysql+pymysql://root:***@localhost:3306/lastcourse
1 rows affected.

[('David Wilson',)]

In [30]:
%%sql
SELECT name,salary AS emp
FROM employees3
WHERE salary > (SELECT salary FROM employees3 WHERE employeeid = 1) AND salary < (SELECT salary FROM employees3 WHERE employeeid = 7);

 * mysql+pymysql://root:***@localhost:3306/lastcourse
1 rows affected.

[('Bob Smith', Decimal('70000.00'))]

1. Emp name, joining date who joined before 'liam andression' and after 'bob brown'
2. Location where avg salary of the location is higher than the overall avg salary
3. Location where avg salary getting greater than the avg salary

In [35]:
%%sql
SELECT name,joining_date
FROM employee
WHERE joining_date < (SELECT joining_date FROM employee WHERE name LIKE "Liam Anderson") 
    AND 
    joining_date > (SELECT joining_date FROM employee WHERE name LIKE "Bob Brown");

 * mysql+pymysql://root:***@localhost:3306/lastcourse
1 rows affected.

[('Grace Lee', datetime.date(2022, 3, 18))]

In [34]:
%%sql
SELECT * FROM EMPLOYEE;

 * mysql+pymysql://root:***@localhost:3306/lastcourse
15 rows affected.

[(1, 'John Smith', datetime.date(2020, 1, 15), 30, 'Software Engineer', 'New York', Decimal('80000.00')),
 (2, 'Jane Do', datetime.date(2019, 3, 22), 28, 'HR Manager', 'Los Angeles', Decimal('75000.00')),
 (3, 'Alice Johnson', datetime.date(2021, 6, 10), 35, 'Data Analyst', 'Chicago', Decimal('70000.00')),
 (4, 'Bob Brown', datetime.date(2022, 2, 5), 40, 'Project Manager', 'Houston', Decimal('90000.00')),
 (5, 'Charlie White', datetime.date(2023, 5, 30), 26, 'Intern', 'Miami', Decimal('30000.00')),
 (6, 'David Wilson', datetime.date(2021, 8, 12), 32, 'Software Engineer', 'Seattle', Decimal('82000.00')),
 (7, 'Emily Davis', datetime.date(2020, 11, 20), 29, 'HR Assistant', 'San Francisco', Decimal('60000.00')),
 (8, 'Frank Miller', datetime.date(2019, 7, 15), 38, 'Data Scientist', 'Boston', Decimal('95000.00')),
 (9, 'Grace Lee', datetime.date(2022, 3, 18), 31, 'Project Coordinator', 'Denver', Decimal('72000.00')),
 (10, 'Henry Garcia', datetime.date(2023, 1, 25), 27, 'Intern', 'Austin', Decimal('35000.00')),
 (11, 'Isabella Martinez', datetime.date(2021, 4, 30), 34, 'Software Engineer', 'New York', Decimal('81000.00')),
 (12, 'Jack Thompson', datetime.date(2020, 9, 10), 36, 'HR Manager', 'Los Angeles', Decimal('77000.00')),
 (13, 'Karen Robinson', datetime.date(2021, 12, 5), 29, 'Data Analyst', 'Chicago', Decimal('71000.00')),
 (14, 'Liam Anderson', datetime.date(2022, 5, 15), 41, 'Project Manager', 'Houston', Decimal('92000.00')),
 (15, 'Mia Clark', datetime.date(2023, 3, 20), 25, 'Intern', 'Miami', Decimal('32000.00'))]

In [37]:
%%sql
SELECT location,ROUND(AVG(salary),2) AS avg_sal
FROM employee
GROUP BY location
HAVING avg_sal > (SELECT AVG(salary)
                    FROM employee);

 * mysql+pymysql://root:***@localhost:3306/lastcourse
7 rows affected.

[('New York', Decimal('80500.00')),
 ('Los Angeles', Decimal('76000.00')),
 ('Chicago', Decimal('70500.00')),
 ('Houston', Decimal('91000.00')),
 ('Seattle', Decimal('82000.00')),
 ('Boston', Decimal('95000.00')),
 ('Denver', Decimal('72000.00'))]

In [41]:
%%sql
SELECT location,ROUND(AVG(salary),2) AS avg_sal
FROM employee
GROUP BY location
HAVING avg_sal > (SELECT AVG(salary) FROM employee);

 * mysql+pymysql://root:***@localhost:3306/lastcourse
7 rows affected.

[('New York', Decimal('80500.00')),
 ('Los Angeles', Decimal('76000.00')),
 ('Chicago', Decimal('70500.00')),
 ('Houston', Decimal('91000.00')),
 ('Seattle', Decimal('82000.00')),
 ('Boston', Decimal('95000.00')),
 ('Denver', Decimal('72000.00'))]

1. Emp name whos getting salary more then the avg salary - 
2. Emp name whos geting salary greater than salary of david wilsona and lesser than the salary of liam andreson - bob brown
3. Emp name,joiningdate whos getting salary greater than the max salary of project manager - frank miller
4. Emp name and roal whos getting salary greater than the max salary salary of data analysist and less than the min salary salary of hr manager
5. How many emp working who joined after greace lee

In [44]:
%%sql
SELECT name 
FROM employee 
WHERE salary > (SELECT AVG(salary) FROM employee);

 * mysql+pymysql://root:***@localhost:3306/lastcourse
11 rows affected.

[('John Smith',),
 ('Jane Do',),
 ('Alice Johnson',),
 ('Bob Brown',),
 ('David Wilson',),
 ('Frank Miller',),
 ('Grace Lee',),
 ('Isabella Martinez',),
 ('Jack Thompson',),
 ('Karen Robinson',),
 ('Liam Anderson',)]

In [46]:
%%sql
# Emp name whos geting salary greater than salary of david wilsona and lesser than the salary of liam andreson
SELECT name 
FROM employee
WHERE 
    salary > (SELECT salary FROM employee WHERE name LIKE "David Wilson")
    AND
    salary < (SELECT salary FROM employee WHERE name LIKE "Liam Anderson");

 * mysql+pymysql://root:***@localhost:3306/lastcourse
1 rows affected.

[('Bob Brown',)]

In [47]:
%%sql
# Emp name,joiningdate whos getting salary greater than the max salary of project manager
SELECT 
    name AS employee,
    joining_date 
FROM employee
WHERE
    salary > (SELECT MAX(salary) FROM employee WHERE role LIKE "project manager");

 * mysql+pymysql://root:***@localhost:3306/lastcourse
1 rows affected.

[('Frank Miller', datetime.date(2019, 7, 15))]

In [49]:
%%sql
# Emp name and roal whos getting salary greater than the max salary salary of data analysist and less than the min salary salary of hr manager
SELECT 
    name AS employee,
    role
FROM employee
WHERE
    salary > (SELECT MAX(salary) FROM employee WHERE role LIKE "Data Analyst")
    AND
    salary < (SELECT MIN(salary) FROM employee WHERE role LIKE "HR Manager");

 * mysql+pymysql://root:***@localhost:3306/lastcourse
1 rows affected.

[('Grace Lee', 'Project Coordinator')]

In [50]:
%%sql
# How many emp working who joined after greace lee
SELECT COUNT(*) AS no_of_emp
FROM employee
WHERE
    joining_date > (SELECT joining_date FROM employee WHERE name LIKE "Grace Lee");

 * mysql+pymysql://root:***@localhost:3306/lastcourse
1 rows affected.

[(4,)]

# More than One table

1. Stud name who are studying in Physics
2. No of stud studying in mathermetics
3. Trainer name who is teacher of jack
4. Find trainer name for alice
5. Find tainer name whos is student with age 20 to 21
6. Find course name which collects fees in range of 1400 to 1500
7.

In [2]:
%%sql
USE lastcourse;
SELECT * FROM STUDENT;

 * mysql+pymysql://root:***@localhost:3306/lastcourse
0 rows affected.
16 rows affected.

[(1, 'Alice', '123 Maple St.', 1, 20, Decimal('1500.00')),
 (2, 'Bob', '456 Oak St.', 2, 22, Decimal('1200.00')),
 (3, 'Charlie', '789 Pine St.', 3, 21, Decimal('1300.00')),
 (4, 'David', '321 Elm St.', 4, 23, Decimal('1400.00')),
 (5, 'Eva', '654 Cedar St.', 5, 19, Decimal('1100.00')),
 (6, 'Frank', '987 Birch St.', 1, 20, Decimal('1500.00')),
 (7, 'Grace', '135 Maple St.', 2, 22, Decimal('1200.00')),
 (8, 'Henry', '246 Oak St.', 3, 21, Decimal('1300.00')),
 (9, 'Irene', '369 Pine St.', 4, 23, Decimal('1400.00')),
 (10, 'Jack', '147 Elm St.', 5, 19, Decimal('1100.00')),
 (11, 'Alice', '123 Maple St.', 2, 20, Decimal('1500.00')),
 (12, 'Alice', '123 Maple St.', 3, 20, Decimal('1500.00')),
 (13, 'Bob', '456 Oak St.', 4, 22, Decimal('1200.00')),
 (14, 'Bob', '456 Oak St.', 5, 22, Decimal('1200.00')),
 (15, 'Charlie', '789 Pine St.', 4, 21, Decimal('1300.00')),
 (16, 'Charlie', '789 Pine St.', 5, 21, Decimal('1300.00'))]

In [3]:
%%sql
SELECT * FROM course;

 * mysql+pymysql://root:***@localhost:3306/lastcourse
6 rows affected.

[(1, 'Computer Science', 'Dr. Smith'),
 (2, 'Mathematics', 'Prof. Johnson'),
 (3, 'Physics', 'Dr. Brown'),
 (4, 'Chemistry', 'Dr. White'),
 (5, 'Biology', 'Prof. Green'),
 (6, 'Data', 'Keerthana')]

In [5]:
%%sql
SELECT name
FROM student
WHERE course_id = (SELECT course_id FROM course WHERE name LIKE 'physics');

 * mysql+pymysql://root:***@localhost:3306/lastcourse
3 rows affected.

[('Charlie',), ('Henry',), ('Alice',)]

In [6]:
%%sql
SELECT COUNT(*) AS Nums
FROM student
WHERE course_id = (SELECT course_id FROM course WHERE name LIKE 'mathematics');

 * mysql+pymysql://root:***@localhost:3306/lastcourse
1 rows affected.

[(3,)]

In [7]:
%%sql
SELECT trainer
FROM course
WHERE course_id = (SELECT course_id FROM student WHERE name LIKE 'jack');

 * mysql+pymysql://root:***@localhost:3306/lastcourse
1 rows affected.

[('Prof. Green',)]

In [8]:
%%sql
SELECT trainer
FROM course
WHERE course_id IN (SELECT course_id FROM student WHERE name LIKE 'alice');

 * mysql+pymysql://root:***@localhost:3306/lastcourse
3 rows affected.

[('Dr. Smith',), ('Prof. Johnson',), ('Dr. Brown',)]

In [11]:
%%sql
SELECT DISTINCT trainer
FROM course
WHERE course_id IN (SELECT course_id FROM student WHERE age BETWEEN 20 AND 21);

 * mysql+pymysql://root:***@localhost:3306/lastcourse
5 rows affected.

[('Dr. Smith',),
 ('Prof. Johnson',),
 ('Dr. Brown',),
 ('Dr. White',),
 ('Prof. Green',)]

In [12]:
%%sql
SELECT DISTINCT name AS course
FROM course
WHERE course_id IN (SELECT course_id FROM student WHERE fees BETWEEN 1400 AND 1500);

 * mysql+pymysql://root:***@localhost:3306/lastcourse
4 rows affected.

[('Computer Science',), ('Mathematics',), ('Physics',), ('Chemistry',)]

In [13]:
%%sql
show tables;

 * mysql+pymysql://root:***@localhost:3306/lastcourse
12 rows affected.

[('course',),
 ('customers',),
 ('data',),
 ('emp',),
 ('employee',),
 ('employees3',),
 ('my_view',),
 ('nulls',),
 ('products',),
 ('sales',),
 ('sales_data',),
 ('student',)]

In [14]:
%%sql
SELECT * FROM products;

 * mysql+pymysql://root:***@localhost:3306/lastcourse
6 rows affected.

[(201, 'Laptop', Decimal('1200.00')),
 (202, 'Smartphone', Decimal('800.00')),
 (203, 'Tablet', Decimal('400.00')),
 (204, 'Headphones', Decimal('150.00')),
 (205, 'Smartwatch', Decimal('250.00')),
 (206, 'pen', Decimal('100.00'))]

In [15]:
%%sql
SELECT * FROM sales;

 * mysql+pymysql://root:***@localhost:3306/lastcourse
8 rows affected.

[(31, 101, 201, datetime.date(2024, 1, 15), 1, 1200),
 (32, 102, 202, datetime.date(2024, 1, 16), 2, 1600),
 (33, 102, 201, datetime.date(2024, 1, 17), 1, 1200),
 (34, 102, 203, datetime.date(2024, 1, 18), 3, 1200),
 (35, 103, 202, datetime.date(2024, 1, 19), 1, 800),
 (36, 103, 204, datetime.date(2024, 1, 20), 2, 300),
 (37, 104, 205, datetime.date(2024, 1, 21), 1, 250),
 (38, 105, 201, datetime.date(2024, 1, 22), 1, 1200)]

In [23]:
%%sql
SELECT p.name
FROM products p LEFT JOIN sales s ON p.product_id = s.product_id
WHERE s.product_id IS NULL;

 * mysql+pymysql://root:***@localhost:3306/lastcourse
1 rows affected.

[('pen',)]

In [22]:
%%sql
SELECT name 
FROM products
WHERE product_id NOT IN (SELECT DISTINCT product_id FROM sales);

 * mysql+pymysql://root:***@localhost:3306/lastcourse
1 rows affected.

[('pen',)]

In [28]:
%%sql
import subprocess

subprocess.run([
    "mysqldump",
    "-u", "root",
    "-p",  # This will prompt for password interactively
    "lastcourse",
    "sales"
], stdout=open("backup_table.sql", "w"))

mysqldump -u root -p lastcourse sales > backup_table.sql

 * mysql+pymysql://root:***@localhost:3306/lastcourse
(pymysql.err.ProgrammingError) (1064, 'You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near \'subprocess\n\nsubprocess.run([\n    "mysqldump",\n    "-u", "root",\n    "-p",  # Thi\' at line 1')
[SQL: import subprocess

subprocess.run([
    "mysqldump",
    "-u", "root",
    "-p",  # This will prompt for password interactively
    "lastcourse",
    "sales"
], stdout=open("backup_table.sql", "w"))

mysqldump -u root -p lastcourse sales > backup_table.sql]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [31]:
import pymysql

connection = pymysql.connect(
    host='localhost',
    user='root',
    password='password',
    database='lastcourse'
)

with connection.cursor() as cursor:
    cursor.execute("SELECT * FROM sales")
    results = cursor.fetchall()

    for row in results:
        values = ", ".join([f"'{v}'" if isinstance(v, str) else str(v) for v in row])
        print(f"INSERT INTO sales VALUES ({values});")

connection.close()

INSERT INTO sales VALUES (31, 101, 201, 2024-01-15, 1, 1200);
INSERT INTO sales VALUES (32, 102, 202, 2024-01-16, 2, 1600);
INSERT INTO sales VALUES (33, 102, 201, 2024-01-17, 1, 1200);
INSERT INTO sales VALUES (34, 102, 203, 2024-01-18, 3, 1200);
INSERT INTO sales VALUES (35, 103, 202, 2024-01-19, 1, 800);
INSERT INTO sales VALUES (36, 103, 204, 2024-01-20, 2, 300);
INSERT INTO sales VALUES (37, 104, 205, 2024-01-21, 1, 250);
INSERT INTO sales VALUES (38, 105, 201, 2024-01-22, 1, 1200);

In [32]:
%%sql
show create table sales;

 * mysql+pymysql://root:***@localhost:3306/lastcourse
1 rows affected.

[('sales', 'CREATE TABLE `sales` (\n  `order_id` int NOT NULL,\n  `customer_id` int NOT NULL,\n  `product_id` int NOT NULL,\n  `sales_date` date DEFAULT NULL,\n  ... (233 characters truncated) ... NT `sales_ibfk_2` FOREIGN KEY (`product_id`) REFERENCES `products` (`Product_id`)\n) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci')]

# Window Function

In [4]:
%%sql
SELECT * FROM employee;

 * mysql+pymysql://root:***@localhost:3306/lastcourse
15 rows affected.

[(1, 'John Smith', datetime.date(2020, 1, 15), 30, 'Software Engineer', 'New York', Decimal('80000.00')),
 (2, 'Jane Do', datetime.date(2019, 3, 22), 28, 'HR Manager', 'Los Angeles', Decimal('75000.00')),
 (3, 'Alice Johnson', datetime.date(2021, 6, 10), 35, 'Data Analyst', 'Chicago', Decimal('70000.00')),
 (4, 'Bob Brown', datetime.date(2022, 2, 5), 40, 'Project Manager', 'Houston', Decimal('90000.00')),
 (5, 'Charlie White', datetime.date(2023, 5, 30), 26, 'Intern', 'Miami', Decimal('30000.00')),
 (6, 'David Wilson', datetime.date(2021, 8, 12), 32, 'Software Engineer', 'Seattle', Decimal('82000.00')),
 (7, 'Emily Davis', datetime.date(2020, 11, 20), 29, 'HR Assistant', 'San Francisco', Decimal('60000.00')),
 (8, 'Frank Miller', datetime.date(2019, 7, 15), 38, 'Data Scientist', 'Boston', Decimal('95000.00')),
 (9, 'Grace Lee', datetime.date(2022, 3, 18), 31, 'Project Coordinator', 'Denver', Decimal('72000.00')),
 (10, 'Henry Garcia', datetime.date(2023, 1, 25), 27, 'Intern', 'Austin', Decimal('35000.00')),
 (11, 'Isabella Martinez', datetime.date(2021, 4, 30), 34, 'Software Engineer', 'New York', Decimal('81000.00')),
 (12, 'Jack Thompson', datetime.date(2020, 9, 10), 36, 'HR Manager', 'Los Angeles', Decimal('77000.00')),
 (13, 'Karen Robinson', datetime.date(2021, 12, 5), 29, 'Data Analyst', 'Chicago', Decimal('71000.00')),
 (14, 'Liam Anderson', datetime.date(2022, 5, 15), 41, 'Project Manager', 'Houston', Decimal('92000.00')),
 (15, 'Mia Clark', datetime.date(2023, 3, 20), 25, 'Intern', 'Miami', Decimal('32000.00'))]

In [12]:
%%sql
SELECT name,salary,
        RANK() OVER(ORDER BY salary DESC) AS rk,
        DENSE_RANK() OVER(ORDER BY salary DESC) AS drk,
        ROW_NUMBER() OVER(ORDER BY salary DESC) AS rnum
FROM employees3;

 * mysql+pymysql://root:***@localhost:3306/lastcourse
7 rows affected.

[('David Wilson', Decimal('90000.00'), 1, 1, 1),
 ('Charlie Brown', Decimal('80000.00'), 2, 2, 2),
 ('Grace Black', Decimal('80000.00'), 2, 2, 3),
 ('Bob Smith', Decimal('70000.00'), 4, 3, 4),
 ('Alice Johnson', Decimal('60000.00'), 5, 4, 5),
 ('Eva Green', Decimal('50000.00'), 6, 5, 6),
 ('Frank White', Decimal('50000.00'), 6, 5, 7)]

In [16]:
%%sql
SELECT name,department,salary,
        DENSE_RANK() OVER(PARTITION BY department ORDER BY salary DESC) AS rk
        FROM employees3;

 * mysql+pymysql://root:***@localhost:3306/lastcourse
7 rows affected.

[('Bob Smith', 'HR', Decimal('70000.00'), 1),
 ('Alice Johnson', 'HR', Decimal('60000.00'), 2),
 ('David Wilson', 'IT', Decimal('90000.00'), 1),
 ('Charlie Brown', 'IT', Decimal('80000.00'), 2),
 ('Grace Black', 'IT', Decimal('80000.00'), 2),
 ('Eva Green', 'Sales', Decimal('50000.00'), 1),
 ('Frank White', 'Sales', Decimal('50000.00'), 1)]

In [19]:
%%sql
DROP TABLE IF EXISTS employees1;
CREATE TABLE Employees1 (
    Name VARCHAR(50),
    Date DATE,
    Salary DECIMAL(10,2)
);

INSERT INTO Employees1 VALUES
    ('Selva', '2023-01-01', 5000),
    ('Selva', '2023-02-01', 5500),
    ('Selva', '2023-03-01', 6000),
    ('Mani', '2023-01-01', 4000),
    ('Mani', '2023-02-01', 4500),
    ('Mani', '2023-03-01', 5000),
    ('Aravind', '2023-01-01', 6000),
    ('Aravind', '2023-02-01', 6500),
    ('Aravind', '2023-03-01', 7000);

 * mysql+pymysql://root:***@localhost:3306/lastcourse
0 rows affected.
0 rows affected.
9 rows affected.

[]

In [20]:
%%sql
SELECT * FROM employees1;

 * mysql+pymysql://root:***@localhost:3306/lastcourse
9 rows affected.

[('Selva', datetime.date(2023, 1, 1), Decimal('5000.00')),
 ('Selva', datetime.date(2023, 2, 1), Decimal('5500.00')),
 ('Selva', datetime.date(2023, 3, 1), Decimal('6000.00')),
 ('Mani', datetime.date(2023, 1, 1), Decimal('4000.00')),
 ('Mani', datetime.date(2023, 2, 1), Decimal('4500.00')),
 ('Mani', datetime.date(2023, 3, 1), Decimal('5000.00')),
 ('Aravind', datetime.date(2023, 1, 1), Decimal('6000.00')),
 ('Aravind', datetime.date(2023, 2, 1), Decimal('6500.00')),
 ('Aravind', datetime.date(2023, 3, 1), Decimal('7000.00'))]

In [27]:
%%sql
SELECT name,date,salary,
        LAG(salary) OVER(PARTITION BY name ORDER BY date ASC) AS lg,
        LEAD(salary) OVER(PARTITION BY name ORDER BY date ASC) AS ld
FROM employees1;

 * mysql+pymysql://root:***@localhost:3306/lastcourse
9 rows affected.

[('Aravind', datetime.date(2023, 1, 1), Decimal('6000.00'), None, Decimal('6500.00')),
 ('Aravind', datetime.date(2023, 2, 1), Decimal('6500.00'), Decimal('6000.00'), Decimal('7000.00')),
 ('Aravind', datetime.date(2023, 3, 1), Decimal('7000.00'), Decimal('6500.00'), None),
 ('Mani', datetime.date(2023, 1, 1), Decimal('4000.00'), None, Decimal('4500.00')),
 ('Mani', datetime.date(2023, 2, 1), Decimal('4500.00'), Decimal('4000.00'), Decimal('5000.00')),
 ('Mani', datetime.date(2023, 3, 1), Decimal('5000.00'), Decimal('4500.00'), None),
 ('Selva', datetime.date(2023, 1, 1), Decimal('5000.00'), None, Decimal('5500.00')),
 ('Selva', datetime.date(2023, 2, 1), Decimal('5500.00'), Decimal('5000.00'), Decimal('6000.00')),
 ('Selva', datetime.date(2023, 3, 1), Decimal('6000.00'), Decimal('5500.00'), None)]

1. Highest salary rank
2. 4th
3. 5th , 6th
4. Chicako highest
5. Soft engg highest
6. Hr highest




1. what is window fn
2. use of partition by
3. lead,lag
4. use case of rank,dense rank,row number
5. cte and advantage and disadvange

In [28]:
%%sql
SELECT * FROM employees3;

 * mysql+pymysql://root:***@localhost:3306/lastcourse
7 rows affected.

[(1, 'Alice Johnson', 'HR', Decimal('60000.00')),
 (2, 'Bob Smith', 'HR', Decimal('70000.00')),
 (3, 'Charlie Brown', 'IT', Decimal('80000.00')),
 (4, 'David Wilson', 'IT', Decimal('90000.00')),
 (5, 'Eva Green', 'Sales', Decimal('50000.00')),
 (6, 'Frank White', 'Sales', Decimal('50000.00')),
 (7, 'Grace Black', 'IT', Decimal('80000.00'))]

In [29]:
%%sql
# 1. Highest salary rank
WITH temp as (SELECT salary,RANK() OVER(ORDER BY salary DESC) AS rk FROM employees3)
SELECT * FROM temp WHERE rk=1;

 * mysql+pymysql://root:***@localhost:3306/lastcourse
1 rows affected.

[(Decimal('90000.00'), 1)]

Task 22-07-2025

1. Highest salary rank
2. 4th
3. 5th , 6th
4. Chicako highest
5. Soft engg highest
6. Hr highest

In [5]:
%%sql
USE lastcourse;
SELECT * FROM employee;

 * mysql+pymysql://root:***@localhost:3306/lastcourse
0 rows affected.
15 rows affected.

[(1, 'John Smith', datetime.date(2020, 1, 15), 30, 'Software Engineer', 'New York', Decimal('80000.00')),
 (2, 'Jane Do', datetime.date(2019, 3, 22), 28, 'HR Manager', 'Los Angeles', Decimal('75000.00')),
 (3, 'Alice Johnson', datetime.date(2021, 6, 10), 35, 'Data Analyst', 'Chicago', Decimal('70000.00')),
 (4, 'Bob Brown', datetime.date(2022, 2, 5), 40, 'Project Manager', 'Houston', Decimal('90000.00')),
 (5, 'Charlie White', datetime.date(2023, 5, 30), 26, 'Intern', 'Miami', Decimal('30000.00')),
 (6, 'David Wilson', datetime.date(2021, 8, 12), 32, 'Software Engineer', 'Seattle', Decimal('82000.00')),
 (7, 'Emily Davis', datetime.date(2020, 11, 20), 29, 'HR Assistant', 'San Francisco', Decimal('60000.00')),
 (8, 'Frank Miller', datetime.date(2019, 7, 15), 38, 'Data Scientist', 'Boston', Decimal('95000.00')),
 (9, 'Grace Lee', datetime.date(2022, 3, 18), 31, 'Project Coordinator', 'Denver', Decimal('72000.00')),
 (10, 'Henry Garcia', datetime.date(2023, 1, 25), 27, 'Intern', 'Austin', Decimal('35000.00')),
 (11, 'Isabella Martinez', datetime.date(2021, 4, 30), 34, 'Software Engineer', 'New York', Decimal('81000.00')),
 (12, 'Jack Thompson', datetime.date(2020, 9, 10), 36, 'HR Manager', 'Los Angeles', Decimal('77000.00')),
 (13, 'Karen Robinson', datetime.date(2021, 12, 5), 29, 'Data Analyst', 'Chicago', Decimal('71000.00')),
 (14, 'Liam Anderson', datetime.date(2022, 5, 15), 41, 'Project Manager', 'Houston', Decimal('92000.00')),
 (15, 'Mia Clark', datetime.date(2023, 3, 20), 25, 'Intern', 'Miami', Decimal('32000.00'))]

In [7]:
%%sql
WITH temp AS(SELECT salary,RANK() OVER(ORDER BY salary DESC) AS rk FROM employee)
SELECT salary
FROM temp
WHERE rk = 1;

 * mysql+pymysql://root:***@localhost:3306/lastcourse
1 rows affected.

[(Decimal('95000.00'),)]

In [8]:
%%sql
WITH temp AS(SELECT salary,DENSE_RANK() OVER(ORDER BY salary DESC) AS rk FROM employee)
SELECT salary
FROM temp
WHERE rk = 4;

 * mysql+pymysql://root:***@localhost:3306/lastcourse
1 rows affected.

[(Decimal('82000.00'),)]

In [9]:
%%sql
WITH temp AS(SELECT salary,DENSE_RANK() OVER(ORDER BY salary DESC) AS rk FROM employee)
SELECT salary
FROM temp
WHERE rk IN (5,6);

 * mysql+pymysql://root:***@localhost:3306/lastcourse
2 rows affected.

[(Decimal('81000.00'),), (Decimal('80000.00'),)]

In [12]:
%%sql
WITH temp AS(SELECT salary,DENSE_RANK() OVER(PARTITION BY location ORDER BY salary DESC) AS rk,location FROM employee)
SELECT salary
FROM temp
WHERE rk=1 AND location LIKE 'Chicago';

 * mysql+pymysql://root:***@localhost:3306/lastcourse
1 rows affected.

[(Decimal('71000.00'),)]

In [13]:
%%sql
WITH temp AS(SELECT salary,DENSE_RANK() OVER(PARTITION BY role ORDER BY salary DESC) AS rk,role FROM employee)
SELECT salary
FROM temp
WHERE rk=1 AND role LIKE 'Software Engineer';

 * mysql+pymysql://root:***@localhost:3306/lastcourse
1 rows affected.

[(Decimal('82000.00'),)]

In [15]:
%%sql
WITH temp AS(SELECT salary,DENSE_RANK() OVER(PARTITION BY role ORDER BY salary DESC) AS rk,role FROM employee)
SELECT salary
FROM temp
WHERE rk=1 AND role LIKE 'HR Manager';

 * mysql+pymysql://root:***@localhost:3306/lastcourse
1 rows affected.

[(Decimal('77000.00'),)]

In [18]:
!pip install numpy pandas scipy matplotlib scikit-learn pickle

Requirement already satisfied: numpy in c:\users\rajes\appdata\local\programs\python\python313\lib\site-packages (2.2.4)
Requirement already satisfied: pandas in c:\users\rajes\appdata\local\programs\python\python313\lib\site-packages (2.2.3)
Requirement already satisfied: scipy in c:\users\rajes\appdata\local\programs\python\python313\lib\site-packages (1.15.2)
Requirement already satisfied: matplotlib in c:\users\rajes\appdata\local\programs\python\python313\lib\site-packages (3.10.1)
Requirement already satisfied: scikit-learn in c:\users\rajes\appdata\local\programs\python\python313\lib\site-packages (1.6.1)

ERROR: Could not find a version that satisfies the requirement pickle (from versions: none)
ERROR: No matching distribution found for pickle

In [21]:
import os, json, time, re
import requests
from bs4 import BeautifulSoup
from urllib.parse import urljoin
from selenium import webdriver
from selenium.webdriver.chrome.options import Options

BASE_URL = "https://www.analyticsvidhya.com"

def setup_selenium():
    opts = Options()
    opts.headless = True
    driver = webdriver.Chrome(options=opts)
    return driver

def fetch_html_with_selenium(url, driver):
    driver.get(url)
    # wait for JS/UI to load
    time.sleep(3)
    return driver.page_source

def extract_links_from_div(soup, div_class):
    div = soup.find("div", class_=div_class)
    if not div:
        raise ValueError(f"Couldn't find div with class '{div_class}'")
    return [urljoin(BASE_URL, a["href"]) for a in div.find_all("a", href=True)]

def find_pdf_links_in_html(html, base_url):
    links = set()

    # 1. <a href="...pdf">
    soup = BeautifulSoup(html, "html.parser")
    for a in soup.find_all("a", href=True):
        if a["href"].lower().endswith(".pdf"):
            links.add(urljoin(base_url, a["href"]))

    # 2. Search JS/JSON for direct PDF URLs
    for match in re.findall(r"https?://[^\s\"']+\.pdf", html):
        links.add(match)

    return list(links)

def download_pdf(pdf_url, save_folder="pdfs"):
    os.makedirs(save_folder, exist_ok=True)
    filename = os.path.join(save_folder, os.path.basename(pdf_url))
    resp = requests.get(pdf_url)
    resp.raise_for_status()
    with open(filename, "wb") as f:
        f.write(resp.content)
    return filename

def main():
    driver = setup_selenium()
    start_url = "https://www.analyticsvidhya.com/blog/2017/01/comprehensive-practical-guide-inferential-statistics-data-science/"
    print("Loading page via Selenium:", start_url)
    main_html = fetch_html_with_selenium(start_url, driver)
    soup = BeautifulSoup(main_html, "html.parser")

    links = extract_links_from_div(soup, "accordion-body border-0 p-0 pb-2")
    print(f"Found {len(links)} links in the accordion.")

    for link in links:
        print("\n➡️ Visiting:", link)
        html = fetch_html_with_selenium(link, driver)
        pdfs = find_pdf_links_in_html(html, link)
        print(f"  → Found {len(pdfs)} PDF link(s).")

        for pdf in pdfs:
            print("    📥 Downloading:", pdf)
            try:
                path = download_pdf(pdf)
                print("       ➤ Saved to:", path)
            except Exception as e:
                print("       ❌ Error:", e)

    driver.quit()
    print("\n✅ Done.")

if __name__ == "__main__":
    main()

Loading page via Selenium: https://www.analyticsvidhya.com/blog/2017/01/comprehensive-practical-guide-inferential-statistics-data-science/
Found 1 links in the accordion.

➡️ Visiting: https://www.analyticsvidhya.com/blog/2017/09/common-machine-learning-algorithms/
  → Found 0 PDF link(s).

✅ Done.

In [20]:
pip install selenium beautifulsoup4 requests

Requirement already satisfied: selenium in c:\users\rajes\appdata\local\programs\python\python313\lib\site-packages (4.16.0)
Requirement already satisfied: beautifulsoup4 in c:\users\rajes\appdata\local\programs\python\python313\lib\site-packages (4.12.2)
Requirement already satisfied: requests in c:\users\rajes\appdata\local\programs\python\python313\lib\site-packages (2.31.0)
Requirement already satisfied: urllib3<3,>=1.26 in c:\users\rajes\appdata\local\programs\python\python313\lib\site-packages (from urllib3[socks]<3,>=1.26->selenium) (2.3.0)
Requirement already satisfied: trio~=0.17 in c:\users\rajes\appdata\local\programs\python\python313\lib\site-packages (from selenium) (0.30.0)
Requirement already satisfied: trio-websocket~=0.9 in c:\users\rajes\appdata\local\programs\python\python313\lib\site-packages (from selenium) (0.12.2)
Requirement already satisfied: certifi>=2021.10.8 in c:\users\rajes\appdata\local\programs\python\python313\lib\site-packages (from selenium) (2025.1.31)
Requirement already satisfied: attrs>=23.2.0 in c:\users\rajes\appdata\local\programs\python\python313\lib\site-packages (from trio~=0.17->selenium) (25.3.0)
Requirement already satisfied: sortedcontainers in c:\users\rajes\appdata\local\programs\python\python313\lib\site-packages (from trio~=0.17->selenium) (2.4.0)
Requirement already satisfied: idna in c:\users\rajes\appdata\local\programs\python\python313\lib\site-packages (from trio~=0.17->selenium) (3.10)
Requirement already satisfied: outcome in c:\users\rajes\appdata\local\programs\python\python313\lib\site-packages (from trio~=0.17->selenium) (1.3.0.post0)
Requirement already satisfied: sniffio>=1.3.0 in c:\users\rajes\appdata\local\programs\python\python313\lib\site-packages (from trio~=0.17->selenium) (1.3.1)
Requirement already satisfied: cffi>=1.14 in c:\users\rajes\appdata\local\programs\python\python313\lib\site-packages (from trio~=0.17->selenium) (1.17.1)
Requirement already satisfied: wsproto>=0.14 in c:\users\rajes\appdata\local\programs\python\python313\lib\site-packages (from trio-websocket~=0.9->selenium) (1.2.0)
Requirement already satisfied: pysocks!=1.5.7,<2.0,>=1.5.6 in c:\users\rajes\appdata\local\programs\python\python313\lib\site-packages (from urllib3[socks]<3,>=1.26->selenium) (1.7.1)
Requirement already satisfied: soupsieve>1.2 in c:\users\rajes\appdata\local\programs\python\python313\lib\site-packages (from beautifulsoup4) (2.6)
Requirement already satisfied: charset-normalizer<4,>=2 in c:\users\rajes\appdata\local\programs\python\python313\lib\site-packages (from requests) (3.4.1)
Requirement already satisfied: pycparser in c:\users\rajes\appdata\local\programs\python\python313\lib\site-packages (from cffi>=1.14->trio~=0.17->selenium) (2.22)
Requirement already satisfied: h11<1,>=0.9.0 in c:\users\rajes\appdata\local\programs\python\python313\lib\site-packages (from wsproto>=0.14->trio-websocket~=0.9->selenium) (0.14.0)
Note: you may need to restart the kernel to use updated packages.

# CTE Common Table Expression

In [13]:
%%sql
WITH temp AS(SELECT name,salary,
        RANK() OVER(ORDER BY salary DESC) AS rk,
        DENSE_RANK() OVER(ORDER BY salary DESC) AS drk,
        ROW_NUMBER() OVER(ORDER BY salary DESC) AS rnum
FROM employees3)

SELECT * FROM temp WHERE drk = 2;

 * mysql+pymysql://root:***@localhost:3306/lastcourse
2 rows affected.

[('Charlie Brown', Decimal('80000.00'), 2, 2, 2),
 ('Grace Black', Decimal('80000.00'), 2, 2, 3)]

In [14]:
%%sql
WITH temp AS(SELECT name,salary,
        DENSE_RANK() OVER(ORDER BY salary DESC) AS drk
FROM employees3)

SELECT * FROM temp WHERE drk = 3;

 * mysql+pymysql://root:***@localhost:3306/lastcourse
1 rows affected.

[('Bob Smith', Decimal('70000.00'), 3)]

# View

In [6]:
%%sql
DROP VIEW IF EXISTS data2;
CREATE VIEW data2 AS(SELECT c_name,quantity,sales FROM data);

 * mysql+pymysql://root:***@localhost:3306/lastcourse
0 rows affected.
0 rows affected.

[]

In [11]:
%%sql
SELECT * FROM data2;

 * mysql+pymysql://root:***@localhost:3306/lastcourse
21 rows affected.

[('Sarah Lee', 1, 150),
 ('Michael Wong', 1, 300),
 ('Emily Davis', 3, 450),
 ('David Kim', 5, 250),
 ('Sophia Patel', 2, 500),
 ('Liam Nguyen', 1, 400),
 ('Isabella Rossi', 3, 225),
 ('Ethan Müller', 2, 360),
 ('Olivia Sato', 1, 350),
 ('Noah Dupont', 4, 240),
 ('Emma Hernandez', 2, 440),
 ('Jacob Kowalski', 2, 560),
 ('Ava Morales', 5, 275),
 ('William Tanaka', 3, 570),
 ('Mia Dupuis', 1, 320),
 ('Alexander Ivanov', 4, 260),
 ('Isabella Garcia', 2, 460),
 ('Daniel Moreno', 2, 580),
 ('Sophia Nguyen', 3, 210),
 ('John Smith', 2, 400),
 ('rajesh', 3, 45000)]

In [8]:
%%sql
SELECT SUM(quantity) FROM data2;

 * mysql+pymysql://root:***@localhost:3306/lastcourse
1 rows affected.

[(Decimal('49'),)]

In [16]:
%%sql
SELECT * FROM student;

 * mysql+pymysql://root:***@localhost:3306/lastcourse
16 rows affected.

[(1, 'Alice', '123 Maple St.', 1, 20, Decimal('1500.00')),
 (2, 'Bob', '456 Oak St.', 2, 22, Decimal('1200.00')),
 (3, 'Charlie', '789 Pine St.', 3, 21, Decimal('1300.00')),
 (4, 'David', '321 Elm St.', 4, 23, Decimal('1400.00')),
 (5, 'Eva', '654 Cedar St.', 5, 19, Decimal('1100.00')),
 (6, 'Frank', '987 Birch St.', 1, 20, Decimal('1500.00')),
 (7, 'Grace', '135 Maple St.', 2, 22, Decimal('1200.00')),
 (8, 'Henry', '246 Oak St.', 3, 21, Decimal('1300.00')),
 (9, 'Irene', '369 Pine St.', 4, 23, Decimal('1400.00')),
 (10, 'Jack', '147 Elm St.', 5, 19, Decimal('1100.00')),
 (11, 'Alice', '123 Maple St.', 2, 20, Decimal('1500.00')),
 (12, 'Alice', '123 Maple St.', 3, 20, Decimal('1500.00')),
 (13, 'Bob', '456 Oak St.', 4, 22, Decimal('1200.00')),
 (14, 'Bob', '456 Oak St.', 5, 22, Decimal('1200.00')),
 (15, 'Charlie', '789 Pine St.', 4, 21, Decimal('1300.00')),
 (16, 'Charlie', '789 Pine St.', 5, 21, Decimal('1300.00'))]

In [17]:
%%sql
SELECT * FROM course;

 * mysql+pymysql://root:***@localhost:3306/lastcourse
6 rows affected.

[(1, 'Computer Science', 'Dr. Smith'),
 (2, 'Mathematics', 'Prof. Johnson'),
 (3, 'Physics', 'Dr. Brown'),
 (4, 'Chemistry', 'Dr. White'),
 (5, 'Biology', 'Prof. Green'),
 (6, 'Data', 'Keerthana')]

In [18]:
%%sql
CREATE VIEW std AS(
                    SELECT s.name,s.age,s.fees,c.trainer
                    FROM student s JOIN course c ON s.course_id = c.course_id);
SELECT * FROM std;

 * mysql+pymysql://root:***@localhost:3306/lastcourse
0 rows affected.
16 rows affected.

[('Alice', 20, Decimal('1500.00'), 'Dr. Smith'),
 ('Frank', 20, Decimal('1500.00'), 'Dr. Smith'),
 ('Bob', 22, Decimal('1200.00'), 'Prof. Johnson'),
 ('Grace', 22, Decimal('1200.00'), 'Prof. Johnson'),
 ('Alice', 20, Decimal('1500.00'), 'Prof. Johnson'),
 ('Charlie', 21, Decimal('1300.00'), 'Dr. Brown'),
 ('Henry', 21, Decimal('1300.00'), 'Dr. Brown'),
 ('Alice', 20, Decimal('1500.00'), 'Dr. Brown'),
 ('David', 23, Decimal('1400.00'), 'Dr. White'),
 ('Irene', 23, Decimal('1400.00'), 'Dr. White'),
 ('Bob', 22, Decimal('1200.00'), 'Dr. White'),
 ('Charlie', 21, Decimal('1300.00'), 'Dr. White'),
 ('Eva', 19, Decimal('1100.00'), 'Prof. Green'),
 ('Jack', 19, Decimal('1100.00'), 'Prof. Green'),
 ('Bob', 22, Decimal('1200.00'), 'Prof. Green'),
 ('Charlie', 21, Decimal('1300.00'), 'Prof. Green')]

In [29]:
%%sql
DROP VIEW IF EXISTS std1;
CREATE VIEW std1 AS(
                    SELECT c.name AS course,SUM(s.fees) AS "fees collected"
                    FROM student s JOIN course c ON s.course_id = c.course_id
                    GROUP BY c.name);

 * mysql+pymysql://root:***@localhost:3306/lastcourse
0 rows affected.
0 rows affected.

[]

In [30]:
%%sql
SELECT * FROM std1;

 * mysql+pymysql://root:***@localhost:3306/lastcourse
5 rows affected.

[('Computer Science', Decimal('3000.00')),
 ('Mathematics', Decimal('3900.00')),
 ('Physics', Decimal('4100.00')),
 ('Chemistry', Decimal('5300.00')),
 ('Biology', Decimal('4700.00'))]

In [37]:
%%sql
SELECT * FROM DATA;

 * mysql+pymysql://root:***@localhost:3306/lastcourse
20 rows affected.

[(1, 'Sarah Lee', 'Mexico City', 'Electronics', 150, 1, 150),
 (2, 'Michael Wong', 'Toronto', 'Furniture', 300, 1, 300),
 (3, 'Emily Davis', 'San Francisco', 'Furniture', 150, 3, 450),
 (4, 'David Kim', 'Vancouver', 'Clothing', 50, 5, 250),
 (5, 'Sophia Patel', 'Tokyo', 'Electronics', 250, 2, 500),
 (6, 'Liam Nguyen', 'Mexico City', 'Furniture', 400, 1, 400),
 (7, 'Isabella Rossi', 'Toronto', 'Clothing', 75, 3, 225),
 (8, 'Ethan Müller', 'San Francisco', 'Electronics', 180, 2, 360),
 (9, 'Olivia Sato', 'Vancouver', 'Furniture', 350, 1, 350),
 (10, 'Noah Dupont', 'Tokyo', 'Clothing', 60, 4, 240),
 (11, 'Emma Hernandez', 'Mexico City', 'Electronics', 220, 2, 440),
 (12, 'Jacob Kowalski', 'Toronto', 'Furniture', 280, 2, 560),
 (13, 'Ava Morales', 'San Francisco', 'Clothing', 55, 5, 275),
 (14, 'William Tanaka', 'Vancouver', 'Electronics', 190, 3, 570),
 (15, 'Mia Dupuis', 'Tokyo', 'Furniture', 320, 1, 320),
 (16, 'Alexander Ivanov', 'Mexico City', 'Clothing', 65, 4, 260),
 (17, 'Isabella Garcia', 'Toronto', 'Electronics', 230, 2, 460),
 (18, 'Daniel Moreno', 'San Francisco', 'Furniture', 290, 2, 580),
 (19, 'Sophia Nguyen', 'Vancouver', 'Clothing', 70, 3, 210),
 (20, 'John Smith', 'Tokyo', 'Electronics', 200, 2, 400)]

# Tigger

In [5]:
%%sql
USE lastcourse;
SHOW tables;

 * mysql+pymysql://root:***@localhost:3306/lastcourse
0 rows affected.
19 rows affected.

[('course',),
 ('cust',),
 ('customers',),
 ('data',),
 ('data2',),
 ('emp',),
 ('employee',),
 ('employees1',),
 ('employees3',),
 ('my_view',),
 ('nulls',),
 ('population',),
 ('products',),
 ('sales',),
 ('sales_data',),
 ('std',),
 ('std1',),
 ('student',),
 ('v_data2',)]

In [6]:
%%sql
CREATE TABLE salary (id INT NOT NULL, hour INT NOT NULL, pay INT NOT NULL);
INSERT INTO salary VALUES (1,4,400),(2,5,500),(3,6,600);

 * mysql+pymysql://root:***@localhost:3306/lastcourse
0 rows affected.
3 rows affected.

[]

In [7]:
%%sql
SELECT * FROM salary;

 * mysql+pymysql://root:***@localhost:3306/lastcourse
3 rows affected.

[(1, 4, 400), (2, 5, 500), (3, 6, 600)]

In [15]:
%%sql
CREATE TRIGGER updation
BEFORE UPDATE ON salary
FOR EACH ROW
SET NEW.pay = NEW.hour * 100;

 * mysql+pymysql://root:***@localhost:3306/lastcourse
0 rows affected.

[]

In [16]:
%%sql
UPDATE salary SET hour = 4 WHERE id = 1;
select * from salary;

 * mysql+pymysql://root:***@localhost:3306/lastcourse
1 rows affected.
3 rows affected.

[(1, 4, 400), (2, 5, 500), (3, 6, 600)]

In [17]:
%%sql
CREATE TABLE audit(id INT NOT NULL, action VARCHAR(5) NOT NULL, time DATETIME);

 * mysql+pymysql://root:***@localhost:3306/lastcourse
0 rows affected.

[]

In [20]:
%%sql
CREATE TABLE audit(id INT NOT NULL, action VARCHAR(10) NOT NULL,user VARCHAR(50) NOT NULL,time DATETIME NOT NULL);

 * mysql+pymysql://root:***@localhost:3306/lastcourse
0 rows affected.

[]

In [25]:
%%sql
DROP TRIGGER IF EXISTS t_audit;
CREATE TRIGGER t_audit
AFTER INSERT ON salary
FOR EACH ROW
INSERT INTO audit VALUES (new.id,"ins",USER(),NOW());

 * mysql+pymysql://root:***@localhost:3306/lastcourse
0 rows affected.
0 rows affected.

[]

In [26]:
%%sql
INSERT INTO salary VALUES (10,10,100);
SELECT * FROM audit;

 * mysql+pymysql://root:***@localhost:3306/lastcourse
1 rows affected.
1 rows affected.

[(10, 'ins', 'root@localhost', datetime.datetime(2025, 7, 24, 18, 16, 13))]

In [28]:
%%sql
CREATE TRIGGER dt_audit
AFTER DELETE ON salary
FOR EACH ROW
INSERT INTO audit VALUES(old.id,"del",USER(),NOW());

 * mysql+pymysql://root:***@localhost:3306/lastcourse
0 rows affected.

[]

In [34]:
%%sql
DELETE FROM salary WHERE id = 10;
SELECT * FROM audit;

 * mysql+pymysql://root:***@localhost:3306/lastcourse
2 rows affected.
3 rows affected.

[(10, 'ins', 'root@localhost', datetime.datetime(2025, 7, 24, 18, 16, 13)),
 (10, 'del', 'root@localhost', datetime.datetime(2025, 7, 24, 18, 30, 12)),
 (10, 'del', 'root@localhost', datetime.datetime(2025, 7, 24, 18, 30, 12))]

In [35]:
%%sql
select * from salary;

 * mysql+pymysql://root:***@localhost:3306/lastcourse
4 rows affected.

[(1, 4, 400), (2, 5, 500), (3, 6, 600), (5, 5, 500)]

In [36]:
%%sql
CREATE TRIGGER ut_audit
AFTER UPDATE ON salary
FOR EACH ROW
INSERT INTO audit VALUES (OLD.id,"upd",NOW());

 * mysql+pymysql://root:***@localhost:3306/lastcourse
0 rows affected.

[]

In [37]:
%%sql
UPDATE salary
SET hour = 1
WHERE id = 1;

 * mysql+pymysql://root:***@localhost:3306/lastcourse
1 rows affected.

[]

In [38]:
%%sql
SELECT * FROM salary;

 * mysql+pymysql://root:***@localhost:3306/lastcourse
4 rows affected.

[(1, 1, 100), (2, 5, 500), (3, 6, 600), (5, 5, 500)]

In [39]:
%%sql
select * from audit;

 * mysql+pymysql://root:***@localhost:3306/lastcourse
4 rows affected.

[(10, 'ins', 'root@localhost', datetime.datetime(2025, 7, 24, 18, 16, 13)),
 (10, 'del', 'root@localhost', datetime.datetime(2025, 7, 24, 18, 30, 12)),
 (10, 'del', 'root@localhost', datetime.datetime(2025, 7, 24, 18, 30, 12)),
 (1, 'upd', 'root@localhost', datetime.datetime(2025, 7, 24, 18, 38, 54))]

# Stored Procedure

In [7]:
%%sql
DELIMITER $$
CREATE PROCEDURE sla(IN id INT)
BEGIN
    SELECT * FROM data WHERE orderid = id;
END $$
DELIMITER ;

 * mysql+pymysql://root:***@localhost:3306/lastcourse
(pymysql.err.ProgrammingError) (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'DELIMITER $$\nCREATE PROCEDURE sla(IN id INT)\nBEGIN\n    SELECT * FROM data WHERE ' at line 1")
[SQL: DELIMITER $$
CREATE PROCEDURE sla(IN id INT)
BEGIN
    SELECT * FROM data WHERE orderid = id;
END $$
DELIMITER ;]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [12]:
%%sql
SHOW CREATE PROCEDURE sla;

 * mysql+pymysql://root:***@localhost:3306/lastcourse
1 rows affected.

[('sla', 'ONLY_FULL_GROUP_BY,STRICT_TRANS_TABLES,NO_ZERO_IN_DATE,NO_ZERO_DATE,ERROR_FOR_DIVISION_BY_ZERO,NO_ENGINE_SUBSTITUTION', 'CREATE DEFINER=`root`@`localhost` PROCEDURE `sla`(IN id INT)\nBEGIN\n    SELECT * FROM data WHERE orderid = id;\nEND', 'utf8mb4', 'utf8mb4_0900_ai_ci', 'utf8mb4_0900_ai_ci')]

In [3]:
%%sql
DROP PROCEDURE IF EXISTS saless;
CREATE PROCEDURE saless(IN id INT,OUT ans INT)
BEGIN
SELECT sales INTO ans FROM data WHERE orderid = id LIMIT 1;
END

 * mysql+pymysql://root:***@localhost:3306/lastcourse
0 rows affected.
0 rows affected.

[]

In [5]:
%%sql
use lastcourse;
SET @sal =0;
CALL saless(4,@sal);
SELECT @sal;

 * mysql+pymysql://root:***@localhost:3306/lastcourse
0 rows affected.
0 rows affected.
1 rows affected.
1 rows affected.

[(250,)]

# Functions

In [5]:
%%sql

CREATE FUNCTION discount(a INT, b INT)
RETURNS INT
DETERMINISTIC
BEGIN
    DECLARE res INT;

    SET res = ((100-b)/100)*a;
    RETURN res;
END

 * mysql+pymysql://root:***@localhost:3306/lastcourse
0 rows affected.

[]

In [9]:
%%sql
SELECT *,DISCOUNT(total,10) AS Disc_Func
FROM sales;

 * mysql+pymysql://root:***@localhost:3306/lastcourse
8 rows affected.

[(31, 101, 201, datetime.date(2024, 1, 15), 1, 1200, 1080),
 (32, 102, 202, datetime.date(2024, 1, 16), 2, 1600, 1440),
 (33, 102, 201, datetime.date(2024, 1, 17), 1, 1200, 1080),
 (34, 102, 203, datetime.date(2024, 1, 18), 3, 1200, 1080),
 (35, 103, 202, datetime.date(2024, 1, 19), 1, 800, 720),
 (36, 103, 204, datetime.date(2024, 1, 20), 2, 300, 270),
 (37, 104, 205, datetime.date(2024, 1, 21), 1, 250, 225),
 (38, 105, 201, datetime.date(2024, 1, 22), 1, 1200, 1080)]

In [12]:
%%sql
USE lastcourse;
DROP FUNCTION IF EXISTS disc;
CREATE FUNCTION disc(a int, b int)
RETURNS INT
DETERMINISTIC
BEGIN
	DECLARE res INT;
    SET res = (100-b)/100*a;
    RETURN res;
END

 * mysql+pymysql://root:***@localhost:3306/lastcourse
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [13]:
%%sql
SELECT *,disc(total,10) FROM sales;

 * mysql+pymysql://root:***@localhost:3306/lastcourse
8 rows affected.

[(31, 101, 201, datetime.date(2024, 1, 15), 1, 1200, 1080),
 (32, 102, 202, datetime.date(2024, 1, 16), 2, 1600, 1440),
 (33, 102, 201, datetime.date(2024, 1, 17), 1, 1200, 1080),
 (34, 102, 203, datetime.date(2024, 1, 18), 3, 1200, 1080),
 (35, 103, 202, datetime.date(2024, 1, 19), 1, 800, 720),
 (36, 103, 204, datetime.date(2024, 1, 20), 2, 300, 270),
 (37, 104, 205, datetime.date(2024, 1, 21), 1, 250, 225),
 (38, 105, 201, datetime.date(2024, 1, 22), 1, 1200, 1080)]

# Coursor

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

# index

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

# partitioning

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql